Repository: python-docs-ko/PEPs-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ko

source: The preferred way of wrapping long lines is by using Python's implied line continuation inside parentheses, brackets and braces. Long lines can be broken over multiple lines by wrapping expressions in parentheses. These should be used in preference to using a backslash for line continuation. Make sure to indent the continued line appropriately. The preferred place to break around a binary operator is *after* the operator, not before it. Some examples::
ko: 글자가 많은 행에 줄바꿈을 적용할 경우 좋은 방법은 괄호, 중괄호, 대괄호 등의 내부에 여러 행의 코드를 적는 것이다. 파이썬에서 이들 코드는 암시적으로 계속 이어지는 것으로 처리된다. 괄호를 사용한 줄바꿈을 적용하여 긴 코드를 여러 행의 코드로 바꿀 수 있다. 이 방법은 줄이 계속됨을 나타내는 백슬래시('\') 문자를 사용하기 전에 사용해야 한다. 이진 연산자에서 줄바꿈을 할 경우 줄바꿈하기 좋은 곳은 연산자의 *다음* 위치이다(이전 위치가 아니다). 몇 가지 예를 살펴보자. ::

source: The rationale should provide evidence of consensus within the community and discuss important objections or concerns raised during discussion.
ko: 근거에서는 커뮤니티의 내에서 합의가 이루어졌음을 증명하고 논의 과정에서 있었던 중요한 반대나 우려에 대하여 논의하여야 한다.

source: There are a lot of different naming styles. It helps to be able to recognize what naming style is being used, independently from what they are used for.
ko: 세상에는 다양한 명명 스타일이 존재한다. 명명 스타일은 이 스타일이 어떤 목적으로 쓰이는지와는 별개로, 어떤 명명 스타일이 쓰이고 있는지 알아보는데 도움이 된다.

source: There are several reference in this PEP to the "BDFL". This acronym stands for "Benevolent Dictator for Life" and refers to Guido van Rossum, the original creator of, and the final design authority for, the Python programming language.
ko: 이 PEP에는 "BDFL"이 여러 번 등장한다. 이는 "Benevolent Dictator for Life (친절한 종신 독재자)"의 약어로서, 파이썬 프로그래밍 언어를 최초로 고안하였으며, 최종적인 디자인 결정권을 가진 Guido van Rossum을 지칭한다.

source: There are some tools already in existence that take advantage of a smaller set of pseudo-codetags (see References_). There is also an example codetags implementation under way, known as the `Codetag Project`__.
ko: There are some tools already in existence that take advantage of a smaller set of pseudo-codetags (see 참조_). There is also an example codetags implementation under way, known as the `Codetag Project`__.

source: There are still many devices around that are limited to 80 character lines; plus, limiting windows to 80 characters makes it possible to have several windows side-by-side. The default wrapping on such devices disrupts the visual structure of the code, making it more difficult to understand. Therefore, please limit all lines to a maximum of 79 characters. For flowing long blocks of text (docstrings or comments), limiting the length to 72 characters is recommended.
ko: 세상에는 한 행에 80글자까지만 표시할 수 있는 장비들이 아직 많이 남아 있다. 게다가, 창 하나에 80글자만 표시하도록 강제할 경우 여러 창을 열어서 늘어놓고 작업할 수 있다. 80글자 제한이 있는 장치에서 자동 줄바꿈 (wrapping)이 일어날 경우 코드의 시각적인 구조가 망가지며, 이렇게 되면 코드를 이해하기 어려워진다. 그러므로 코드 한 행은 최대 79글자로 제한하도록 하자. 텍스트가 길게 이어지는 경우(docstring 혹은 주석문)에는 72글자로 제한하는 것을 권장한다.

source: There are three kinds of PEP:
ko: PEP에는 다음의 세 가지 종류가 있다.

source: There are two PEP formats available to authors: plaintext and reStructuredText_. Both are UTF-8-encoded text files.
ko: 저자가 사용할 수 있는 PEP 형식에는 일반 텍스트와 reStructuredText_\ 의 두 가지가 있다. 양쪽 다 UTF-8 인코딩의 텍스트 파일이다.

source: There is a Python script that converts both styles of PEPs to HTML for viewing on the web [5]_. Parsing and conversion of plaintext PEPs is self-contained within the script. reStructuredText PEPs are parsed and converted by Docutils_ code called from the script.
ko: 각 스타일의 PEP를 웹에서 보여질 HTML로 변환하는 파이썬 스크립트가 있다. [5]_ 일반 텍스트 PEP의 분석과 변환은 스크립트 내에 포함되어 있다. reStructuredText PEP는 스크립트에서 호출하는 Docutils_ 코드에 의하여 변환된다.

source: There's also the style of using a short unique prefix to group related names together. This is not used much in Python, but it is mentioned for completeness. For example, the ``os.stat()`` function returns a tuple whose items traditionally have names like ``st_mode``, ``st_size``, ``st_mtime`` and so on. (This is done to emphasize the correspondence with the fields of the POSIX system call struct, which helps programmers familiar with that.)
ko: 서로 연관이 있는 명칭들을 통합하기 위해 짧은 고유 접두사를 사용하는 스타일 또한 존재한다. 파이썬에서는 이러한 스타일이 많이 쓰이지 않고 있으나, 이 문서의 완결성을 위해 언급해둔다. 예를 들어 ``os.stat()`` 함수는 전통적으로 ``st_mode``, ``st_size``, ``st_mtime`` 등의 이름을 가진 항목이 담긴 튜플을 반환한다. (이들은 POSIX 시스템 호출 구조체의 필드와 관련이 있음을 강조하기 위해 쓰인 것이다. POSIX에 익숙한 프로그래머에게는 도움이 된다.)

source: These lines should be included after the module's docstring, before any other code, separated by a blank line above and below.
ko: 위 내용은 모듈의 docstring 바로 다음에 와야 하며, 그 이후에는 프로그램 코드가 온다. 그리고 이 행의 위와 아래에는 빈 줄 한 개씩이 들어가야 한다.

source: This PEP contained guidelines for handling bug reports in the Python bug tracker. It has been replaced by the Issue Workflow described at
ko: 이 PEP는 Python 버그 트래커에서 버그 리포트를 다루는 것에 대한 안내를 담고 있다. 다음에서 기술하는 이슈 작업흐름에 의하여 대체되었다.

source: This PEP has been superseded by the updated material in the Python Developer's Guide [1].
ko: 이 PEP는 Python 개발자 안내서의 새로운 내용으로 대체되었다. [1]

source: This document and PEP 257 (Docstring Conventions) were adapted from Guido's original Python Style Guide essay, with some additions from Barry's style guide [2]_.
ko: 이 문서와 PEP 257(Docstring 규칙)은 귀도가 작성한 파이썬 스타일 가이드에 관한 짧은 글에 바탕을 두고 있으며, 후에 배리의 스타일 가이드 [2]\ 에서 일부 내용을 추가하였다.

source: This document gives coding conventions for the C code comprising the C implementation of Python. Please see the companion informational PEP describing style guidelines for Python code [1]_.
ko: 이 문서는 파이썬의 C 구현을 구성하는 C 코드에 대한 코딩 관례를 제시한다. 파이썬 코드에 대한 스타일 안내를 기술하는 정보 PEP를 함께 보기를 권한다 [1]_.

source: This document gives coding conventions for the Python code comprising the standard library in the main Python distribution. Please see the companion informational PEP describing style guidelines for the C code in the C implementation of Python [1]_.
ko: 이 문서는 기본 파이썬 배포판의 표준 라이브러리를 구성하는 파이썬 코드의 코딩 규칙(coding convention)을 설명한다. 파이썬의 C 구현에 대한 스타일 가이드라인을 설명하는 PEP [1]\ 도 참고하길 바란다.

source: This document has been placed in the Public Domain.
ko: 이 문서는 퍼블릭 도메인에 속한다.

source: This document has been placed in the public domain.
ko: 이 문서는 퍼블릭 도메인에 속한다.

source: This document is in the public domain.
ko: 이 문서는 퍼블릭 도메인에 속한다.

source: This document is licensed under the `Open Publication License`_.
ko: This document is licensed under the `공개 출판 라이선스`_.

source: This document is placed in the public domain.
ko: 이 문서는 퍼블릭 도메인에 속한다.

source: This option does not solve issues listed in the `Rationale`_ section, it only provides an helper to fix them. All functions creating file descriptors have to be modified to set *cloexec=True* in each module used by an application to fix all these issues.
ko: This option does not solve issues listed in the `근거`_ section, it only provides an helper to fix them. All functions creating file descriptors have to be modified to set *cloexec=True* in each module used by an application to fix all these issues.

source: To avoid name clashes with subclasses, use two leading underscores to invoke Python's name mangling rules.
ko: 서브클래스와의 이름 충돌을 피하기 위해, 앞에 두 개의 언더스코어를 붙여 파이썬의 네임 맹글링 규칙을 따른다.

source: To minimize the effort involved, the ``functools.total_ordering()`` decorator provides a tool to generate missing comparison methods.
ko: ``functools.total_ordering()`` 데코레이터는 구현되지 않은 비교 연산 메서드를 자동으로 생성해주는 도구를 제공하므로, 이러한 구현에 들어가는 노력을 최소화할 수 있다.

source: Tools
ko: 도구

source: Transferring PEP Ownership ==========================
ko: PEP 소유권의 이양 =================

source: Two good reasons to break a particular rule:
ko: 특정한 규칙을 무시해도 괜찮은 두 가지 경우를 살펴보자.

source: Unresolved Issues
ko: 미해결 사항

source: Unresolved Issues Do we need to make it possible to disable the 3 hard-wired modules without manually hacking the Makefiles? [Answer: No.]
ko: 미해결 사항 Do we need to make it possible to disable the 3 hard-wired modules without manually hacking the Makefiles? [Answer: No.]

source: Unresolved Issues Is there a way to escape characters in ST? If so, how? (example: * at the beginning of a line without being bullet symbol)
ko: 미해결 사항 Is there a way to escape characters in ST? If so, how? (example: * at the beginning of a line without being bullet symbol)

source: Unsupporting platforms ----------------------
ko: 지원하지 않는 플랫폼 --------------------

source: Updates to existing PEPs also come in to peps@python.org. Many PEP authors are not Python committers yet, so PEP editors do the commits for them.
ko: 기존의 PEP에 대한 수정 또한 peps@python.org\ 에 들어온다. 많은 PEP 저자는 아직 Python 커미터가 아니므로, PEP 편집자가 대신에 커밋을 해준다.

source: Use 4 spaces per indentation level.
ko: 4개의 공백을 들여쓰기의 단위로 사용하라.

source: Use blank lines in functions, sparingly, to indicate logical sections.
ko: 함수 내에서 논리적인 단위를 드러내기 위해 빈 줄을 사용하라. (하지만 아껴서 사용하자)

source: Use inline comments sparingly.
ko: 인라인 주석문은 아껴서 사용한다.

source: Use one leading underscore only for non-public methods and instance variables.
ko: 비 public 메서드/인스턴스 변수의 경우 앞에 언더스코어 문자를 하나 붙인다.

source: Use the function naming rules: lowercase with words separated by underscores as necessary to improve readability.
ko: 다음 함수 명명 규칙을 사용한다: 소문자로 된 단어를 사용하며, 각 단어는 필요에 따라 가독성을 높이기 위해 언더스코어로 구분한다.

source: Version Bookkeeping ===================
ko: 버전 관리 =========

source: Vetting an idea publicly before going as far as writing a PEP is meant to save the potential author time. Many ideas have been brought forward for changing Python that have been rejected for various reasons. Asking the Python community first if an idea is original helps prevent too much time being spent on something that is guaranteed to be rejected based on prior discussions (searching the internet does not always do the trick). It also helps to make sure the idea is applicable to the entire community and not just the author. Just because an idea sounds good to the author does not mean it will work for most people in most areas where Python is used.
ko: PEP를 작성하기에 앞서 아이디어를 공개적으로 검토함으로써 저자의 시간을 절약할 수 있다. 파이썬에 변경을 일으킬 수 있는 많은 아이디어가 여러 이유로 인해 기각된다. 이전의 논의에 의거하여 기각될 것이 자명한 아이디어에 불필요한 시간을 낭비하지 않도록 파이썬 커뮤니티에 먼저 물어보라(인터넷을 찾아보는 것이 능사는 아니다). 또한 저자만이 아니라 전체 커뮤니티에 적용이 가능한지 확인하는 것도 도움이 된다. 저자가 생각하기에 좋은 아이디어라 할지라도 파이썬을 사용하는 대다수의 영역의 사람들에게도 그렇지는 않을 수도 있기 때문이다.

source: Warnings and Errors
ko: 경고 및 오류

source: We don't use the term "private" here, since no attribute is really private in Python (without a generally unnecessary amount of work).
ko: 여기서는 "private"이란 단어를 사용하지 않는다. 사실 파이썬에는 private 어트리뷰트가 존재하지 않기 때문이다 (필요 이상의 작업을 동원하지 않을 경우에 그렇다는 이야기이다).

source: We intend PEPs to be the primary mechanisms for proposing major new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
ko: 우리의 의도는 PEP가 굵직한 새 기능에 대한 제안을 하는 기본적인 메커니즘이 되며, 이슈에 대한 커뮤니티의 의견을 수렴하고, 파이썬에 적용하게 될 설계상의 결정에 대한 기록이 되도록 하는 것이다. PEP의 저자는 지역 사회 내에서 합의를 구축하고 반대 의견을 문서화 할 책임이 있다.

source: What belongs in a successful PEP? =================================
ko: 성공적인 PEP의 요소 ===================

source: What is a PEP? ==============
ko: PEP의 정의 ==========

source: When a PEP is Accepted, Rejected or Withdrawn, the PEP should be updated accordingly. In addition to updating the status field, at the very least the Resolution header should be added with a link to the relevant post in the python-dev mailing list archives.
ko: PEP가 수용(Accepted), 거부 또는 철회되면, 그에 따라 PEP를 갱신하여야 한다. 상태 필드를 갱신함에 덧붙여, python-dev 메일링 리스트 아카이브의 관련된 게시물을 링크하는 최소한의 Resolution header를 추가하도록 한다.

source: When an extension module written in C or C++ has an accompanying Python module that provides a higher level (e.g. more object oriented) interface, the C/C++ module has a leading underscore (e.g. ``_socket``).
ko: C/C++로 작성된 확장 모듈이 고수준 인터페이스(예를 들어 좀 더 객체 지향적인)를 제공하는 파이썬 모듈을 갖추고 있을 경우, 해당 C/C++ 모듈은 앞에 언더스코어를 사용한다 (예를 들면 ``_socket``).

source: When checking if an object is a string, keep in mind that it might be a unicode string too! In Python 2.3, str and unicode have a common base class, basestring, so you can do::
ko: 객체가 문자열인지 확인할 경우, 해당 문자열이 유니코드 문자열일 수도 있다는 점을 명심하자. 파이썬 2.3에서는 str, unicode가 동일한 기본 클래스인 basestring을 상속하므로 다음과 같은 구문을 사용할 수 있다. ::

source: When in doubt about where to send your changes, please check first with the PEP author and/or a PEP editor.
ko: 수정 사항을 어디에 보내야할지 확신이 서지 않는다면, PEP 저자 또는 편집자에게 먼저 문의하기 바란다.

source: When new modules were added to the standard Python library in the past, it was not possible to foresee whether they would still be useful in the future. Even though Python "Comes With Batteries Included", batteries may discharge over time. Carrying old modules around is a burden on the maintainer, especially when there is no interest in the module anymore.
ko: 과거에 표준 파이썬 라이브러리에 새로운 모듈이 추가되었을 때에는, 그것이 미래에도 계속 유용할 것인지 예상할 수 없었다. 파이썬의 "배터리 포함"에도 불구하고, 배터리는 방전될 수 있다. 오래된 모듈을 끌고가는 것은 관리자에게는 부담이 되며, 특히 그 모듈이 더 이상 필요하지 않을 때에는 더욱 그러하다.

source: When referencing an external web page in the body of a PEP, you should include the title of the page in the text, with either an inline hyperlink reference to the URL or a footnote reference (see `Footnotes`_ below). Do not include the URL in the body text of the PEP.
ko: When referencing an external web page in the body of a PEP, you should include the title of the page in the text, with either an inline hyperlink reference to the URL or a footnote reference (see `각주`_ below). Do not include the URL in the body text of the PEP.

source: When writing English, Strunk and White apply.
ko: 영문으로 작성할 경우 Strunk와 White의 스타일을 적용한다(역자 주: 영어 작문에 관한 책인 'The Elements of Style'의 저자).

source: Whitespace in Expressions and Statements ========================================
ko: 표현식, 구문에서의 공백 문자 ============================

source: Windows Notes
ko: Windows 참고

source: With this in mind, here are the Pythonic guidelines:
ko: 파이썬의 다음과 같은 가이드라인을 마음에 새기도록 하자.

source: Withdrawal
ko: 포기

source: Yes: if greeting: No: if greeting == True: Worse: if greeting is True:
ko: 좋음: if greeting: 나쁨: if greeting == True: 최악: if greeting is True:

source: Yes: dict['key'] = list[index] No: dict ['key'] = list [index]
ko: 좋음: dict['key'] = list[index] 나쁨: dict ['key'] = list [index]

source: Yes: if foo.startswith('bar'): No: if foo[:3] == 'bar':
ko: 좋음: if foo.startswith('bar'): 나쁨: if foo[:3] == 'bar':

source: Yes: if isinstance(obj, int):
ko: 좋음: if isinstance(obj, int):

source: Yes: if not seq: if seq:
ko: 좋음: if not seq: if seq:

source: Yes: if x == 4: print x, y; x, y = y, x No: if x == 4 : print x , y ; x , y = y , x
ko: 좋음: if x == 4: print x, y; x, y = y, x 나쁨: if x == 4 : print x , y ; x , y = y , x

source: Yes: import os import sys
ko: 좋음: import os import sys

source: Yes: spam(1) No: spam (1)
ko: 좋음: spam(1) 나쁨: spam (1)

source: Yes: spam(ham[1], {eggs: 2}) No: spam( ham[ 1 ], { eggs: 2 } )
ko: 좋음: spam(ham[1], {eggs: 2}) 나쁨: spam( ham[ 1 ], { eggs: 2 } )

source: Yes::
ko: 좋음::

source: You should put a blank line between each group of imports.
ko: 각 그룹 사이에는 빈 줄 하나를 넣어야 한다.

source: You should use two spaces after a sentence-ending period.
ko: 문장의 마침표 다음에는 두 개의 공백을 넣는다.

source: [1] Adding to the Stdlib http://docs.python.org/devguide/stdlibchanges.html
ko: [1] Stdlib에 추가하기 http://docs.python.org/devguide/stdlibchanges.html

source: `Footnotes`_ ============
ko: `각주`_ =======

source: `single-quoted' or ``double-quoted''
ko: `single-quoted' 또는 ``double-quoted''

source: and use "myclass.MyClass" and "foo.bar.yourclass.YourClass".
ko: 그런 다음 "myclass.MyClass", "foo.bar.yourclass.YourClass" 같은 식으로 클래스를 사용하면 된다.

source: if the address is not given. For historical reasons the format "address@dom.ain (Random J. User)" may appear in a PEP, however new PEPs must use the mandated format above, and it is acceptable to change to this format when PEPs are updated.
ko: 주소가 없을 경우 위와 같이 쓰면 된다. 과거의 PEP에는 "address@dom.ain (Random J. User)"와 같은 형식으로 쓰여진 것이 남아 있을 수도 있지만, 새롭게 쓰여지는 PEP는 위의 형식을 따라야 하며, 기존의 PEP를 갱신할 때에 새로운 형식으로 변경할 수 있다.

source: if the email address is included, and just
ko: 이메일 주소가 있을 경우에는 위와 같이 쓰고,

source: mixedCase is allowed only in contexts where that's already the prevailing style (e.g. threading.py), to retain backwards compatibility.
ko: mixedCase 스타일의 경우, 이미 mixedCase 스타일을 따르고 있는 모듈 (예: threading.py)에서만 하위 호환성 유지를 위해 허용된다.

source: or it may be lined up under the first character of the line that starts the multi-line construct, as in::
ko: 혹은 이렇게 여러 줄에 걸친 코드의 첫 번째 문자 위치에 닫는 표시를 넣을 수도 있다. 다음 코드를 보자. ::

source: startswith() and endswith() are cleaner and less error prone. For example::
ko: startswith()와 endswith()는 의미가 명확하므로 오류가 발생할 여지가 적다. 예를 들면, ::

source: try: # Too broad! return handle_value(collection[key]) except KeyError: # Will also catch KeyError raised by handle_value() return key_not_found(key)
ko: try: # 코드 적용 범위가 넓다! return handle_value(collection[key]) except KeyError: # 여기서는 handle_value()이 발생시킨 KeyError 예외를 처리 return key_not_found(key)
